# Merhabalar

Bu notlarda python pandas kütüphanesi ile çalışırken aldığım notlar ve örnekler yer almaktadır.


Pandas Numpy dan farklı olarak bize yapısal veri setleriyle daha esnek bir şekilde çalışma imkanı sağlar. Pandas içerisinde daha farklı veri tipleriyle çalışabiliyoruz.

İyi Gezinmeler :)

#### Pandas kütüphanesi nasıl tanımlanır

In [1]:
import pandas as pd

#### Pandas Serisi Oluşturmak

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

Listenin type methoduyla tipini sorduğumuzda pandas serisi olduğunu görebiliriz.

In [3]:
a = pd.Series([1,2,3,4,5])
type(a)

pandas.core.series.Series

* **axes** : Serinin index bilgilerine erişiriz
* **ndim**: Boyut sayısı
* **shape**: Boyut bilgisi
* **size**: Toplam eleman sayısı
* **dytpe**: Array veri tipi
* **values** : Değerlere tek başına erişmek için kullanılır.

In [4]:
a.axes

[RangeIndex(start=0, stop=5, step=1)]

In [5]:
a.ndim

1

In [6]:
a.shape

(5,)

In [7]:
a.size

5

In [8]:
a.dtype

dtype('int64')

In [9]:
a.values

array([1, 2, 3, 4, 5], dtype=int64)

Pandas ta baştan elemanlarına erişmek için head fonksiyonu kullanılır.

In [10]:
a.head(3)

0    1
1    2
2    3
dtype: int64

Pandas ta sondan elemanlarına erişmek için head fonksiyonu kullanılır.

In [11]:
a.tail(2)

3    4
4    5
dtype: int64

İndex ile seride hangi değerin hangi indexte olduğunu yazabiliriz indexin değerini değiştirebilirz.

In [12]:
pd.Series([24,987,12,34,188,1], index = [1,3,5,7,9,11])

1      24
3     987
5      12
7      34
9     188
11      1
dtype: int64

In [13]:
seri_1 = pd.Series([24,987,12,34,188,1], index = ["bir","iki","uc","dort","bes","alti"])
seri_1

bir      24
iki     987
uc       12
dort     34
bes     188
alti      1
dtype: int64

In [14]:
seri_1["iki"]

987

In [15]:
seri_1["bir":"dort"]

bir      24
iki     987
uc       12
dort     34
dtype: int64

Sözlük üzerinden liste oluşturmak

In [16]:
sozluk = pd.Series({"on":10, "yirmi":20, "otuz":30})
sozluk

on       10
yirmi    20
otuz     30
dtype: int64

In [17]:
seri_2 = {"on":10, "yirmi":20, "otuz":30}
sozluk = pd.Series(seri_2,)
sozluk

on       10
yirmi    20
otuz     30
dtype: int64

İki seriyi birleştirmek için concat fonksşyoınunu kullanırız.

In [18]:
pd.concat([seri_1,sozluk])

bir       24
iki      987
uc        12
dort      34
bes      188
alti       1
on        10
yirmi     20
otuz      30
dtype: int64

#### Eleman İşlemleri

In [19]:
import numpy as np
a = np.array([1,2,3,4,5])
seri_1 = pd.Series(a)
seri_1

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [20]:
seri_1[0]

1

In [21]:
seri_1[1:3]

1    2
2    3
dtype: int32

In [22]:
seri_2 = pd.Series([23,33,53,43,13], index = ["a","b","c","d","e"])
seri_2

a    23
b    33
c    53
d    43
e    13
dtype: int64

In [23]:
seri_2.keys

<bound method Series.keys of a    23
b    33
c    53
d    43
e    13
dtype: int64>

In [24]:
list(seri_2.items())

[('a', 23), ('b', 33), ('c', 53), ('d', 43), ('e', 13)]

In [25]:
seri_2.values

array([23, 33, 53, 43, 13], dtype=int64)

Eleman sorgulama

In [26]:
"d" in seri_2

True

In [27]:
"f" in seri_2

False

In [28]:
seri_2["c"]

53

Fancy ile eleman seçme

In [29]:
seri_2[["b","d"]]

b    33
d    43
dtype: int64

In [30]:
seri_2["a"] = 63
seri_2["a"]

63

In [31]:
seri_2["a":"c"]

a    63
b    33
c    53
dtype: int64

#### Pandan DataFrame Oluşturma

In [32]:
import pandas as pd
a = [1,4,9,16,12,13]
a

[1, 4, 9, 16, 12, 13]

In [33]:
pd.DataFrame(a, columns = ["Günlük Çalışma Saatleri"])

   Günlük Çalışma Saatleri
0                        1
1                        4
2                        9
3                       16
4                       12
5                       13

In [34]:
import numpy as np
b = np.arange(1,10).reshape(3,3)
b

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [35]:
df = pd.DataFrame(b, columns = ["a", "b", "c"])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

sutun isimlerinin değiştirmek istersek columns fonksiyonuyla değiştirebiliriz.

In [36]:
df.columns = ("deger1", "deger2", "deger3")
df

   deger1  deger2  deger3
0       1       2       3
1       4       5       6
2       7       8       9

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df.ndim

2

In [39]:
df.shape

(3, 3)

In [40]:
df.size

9

In [41]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deger1', 'deger2', 'deger3'], dtype='object')]

In [42]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [43]:
type(df.values)

numpy.ndarray

In [44]:
df.head(1)

   deger1  deger2  deger3
0       1       2       3

In [45]:
df.tail(1)

   deger1  deger2  deger3
2       7       8       9

In [46]:
c = np.array([1,2,3,4,5])
pd.DataFrame(c, columns = ["degerler"])

   degerler
0         1
1         2
2         3
3         4
4         5

In [47]:
d = np.arange(0,64).reshape(8,8)
d

array([[ 0,  1,  2,  3,  4,  5,  6,  7],
       [ 8,  9, 10, 11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20, 21, 22, 23],
       [24, 25, 26, 27, 28, 29, 30, 31],
       [32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47],
       [48, 49, 50, 51, 52, 53, 54, 55],
       [56, 57, 58, 59, 60, 61, 62, 63]])

In [48]:
pd.DataFrame(d, columns = ["s", "a", "d", "u", "l","l","a","h"])

    s   a   d   u   l   l   a   h
0   0   1   2   3   4   5   6   7
1   8   9  10  11  12  13  14  15
2  16  17  18  19  20  21  22  23
3  24  25  26  27  28  29  30  31
4  32  33  34  35  36  37  38  39
5  40  41  42  43  44  45  46  47
6  48  49  50  51  52  53  54  55
7  56  57  58  59  60  61  62  63

#### DataFrame Eleman İşlemleri

In [49]:
import numpy as np
a = np.random.randint(10, size = 5)
b = np.random.randint(10, size = 5)
c = np.random.randint(10, size = 5)
d = np.random.randint(10, size = 5)
e = np.random.randint(10, size = 5)

In [50]:
sozluk = {"deger_1": a, "deger_2":b, "deger_3":c, "deger_4":d, "deger_5":e}
sozluk

{'deger_1': array([1, 4, 0, 5, 7]),
 'deger_2': array([9, 3, 3, 1, 5]),
 'deger_3': array([1, 9, 2, 8, 1]),
 'deger_4': array([4, 1, 2, 6, 5]),
 'deger_5': array([2, 4, 4, 6, 5])}

In [51]:
df = pd.DataFrame(sozluk)
df

   deger_1  deger_2  deger_3  deger_4  deger_5
0        1        9        1        4        2
1        4        3        9        1        4
2        0        3        2        2        4
3        5        1        8        6        6
4        7        5        1        5        5

In [52]:
df[0:2]

   deger_1  deger_2  deger_3  deger_4  deger_5
0        1        9        1        4        2
1        4        3        9        1        4

In [53]:
df.index = ["a", "b", "c", "d", "e"]
df

   deger_1  deger_2  deger_3  deger_4  deger_5
a        1        9        1        4        2
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [54]:
df["b":"d"]

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6

drop fonksiyonuyla sutunu sileriz ama ana serimizde değişme olmaz

In [55]:
df.drop("a", axis = 0)

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [56]:
df

   deger_1  deger_2  deger_3  deger_4  deger_5
a        1        9        1        4        2
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [57]:
eğer ana serimizde de değişme olmasını istiyorsak inplace kullanırız.

SyntaxError: invalid syntax (<ipython-input-57-6679d8e56d6f>, line 1)

In [58]:
df.drop("a", axis = 0, inplace = True)
df

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [59]:
df.drop("deger_2", axis = 1)

   deger_1  deger_3  deger_4  deger_5
b        4        9        1        4
c        0        2        2        4
d        5        8        6        6
e        7        1        5        5

In [60]:
df

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [61]:
silinicek_satirlar = ["c", "e"]

In [62]:
df.drop(silinicek_satirlar, axis = 0)

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
d        5        1        8        6        6

In [63]:
df

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [64]:
sorgu = ["deger_1","deger_8","deger_5","deger_7"]
for i in sorgu:
    print(i in df)

True
False
True
False

In [65]:
df

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [66]:
df["deger_6"] = df["deger_1"] / df["deger_2"]
df

   deger_1  deger_2  deger_3  deger_4  deger_5   deger_6
b        4        3        9        1        4  1.333333
c        0        3        2        2        4  0.000000
d        5        1        8        6        6  5.000000
e        7        5        1        5        5  1.400000

In [67]:
df.drop("deger_6", axis = 1, inplace = True)
df

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

In [68]:
silme = ["deger_2", "deger_3"]
df.drop(silme, axis = 1)

   deger_1  deger_4  deger_5
b        4        1        4
c        0        2        4
d        5        6        6
e        7        5        5

In [69]:
df

   deger_1  deger_2  deger_3  deger_4  deger_5
b        4        3        9        1        4
c        0        3        2        2        4
d        5        1        8        6        6
e        7        5        1        5        5

#### Gözlem ve Değişken Seçimi

In [70]:
import numpy as np
import pandas as pd
seri = np.random.randint(1,50, size = (10,5))
df = pd.DataFrame(seri , columns = ["deger_1", "deger_2", "deger_3", "deger_4", "deger_5"])
df

   deger_1  deger_2  deger_3  deger_4  deger_5
0       23        3       48       14       27
1       14        7       20       39       24
2       12       11       15       27       29
3       12       24       20       25       21
4       10       23       44       40       43
5       36        8       15       44       40
6       14       39       47       10       34
7       22       11       27       31       35
8        7       18        6        5       44
9       33       37        5       43        5

* **loc** : Tanımlandığı şekliyle seçim yapmak için kullanılır.
* **iloc** : Alışık olduğumuz indexleme mantığıyla seçim yapar

In [71]:
df.loc[:3]

   deger_1  deger_2  deger_3  deger_4  deger_5
0       23        3       48       14       27
1       14        7       20       39       24
2       12       11       15       27       29
3       12       24       20       25       21

In [72]:
df.iloc[:3]

   deger_1  deger_2  deger_3  deger_4  deger_5
0       23        3       48       14       27
1       14        7       20       39       24
2       12       11       15       27       29

In [73]:
df.iloc[0,0]

23

In [74]:
df.iloc[:3,:3]

   deger_1  deger_2  deger_3
0       23        3       48
1       14        7       20
2       12       11       15

In [75]:
df.loc[0:3, "deger_2"]

0     3
1     7
2    11
3    24
Name: deger_2, dtype: int32

In [76]:
df.iloc[0:3]["deger_2"]

0     3
1     7
2    11
Name: deger_2, dtype: int32

In [77]:
df.iloc[6:,1:3]

   deger_2  deger_3
6       39       47
7       11       27
8       18        6
9       37        5

#### Koşullu Eleman İşlemleri

In [78]:
import numpy as np
import pandas as pd
seri = np.random.randint(1,50, size = (10,5))
df = pd.DataFrame(seri , columns = ["deger_1", "deger_2", "deger_3", "deger_4", "deger_5"])
df

   deger_1  deger_2  deger_3  deger_4  deger_5
0        7       40       25       41       37
1       46       35       30       17       35
2       14        6       29       15       42
3       49       43       20       33       37
4       39       48        5        9       45
5       46       42       32       24        8
6       13       27       16       26       49
7       29       12        6        1       25
8       11       35       40        2       28
9       48       33       43       48       48

In [79]:
df["deger_1"][0:3]

0     7
1    46
2    14
Name: deger_1, dtype: int32

In [80]:
df[0:3][["deger_2", "deger_3"]]

   deger_2  deger_3
0       40       25
1       35       30
2        6       29

In [81]:
df[df.deger_1 > 20]

   deger_1  deger_2  deger_3  deger_4  deger_5
1       46       35       30       17       35
3       49       43       20       33       37
4       39       48        5        9       45
5       46       42       32       24        8
7       29       12        6        1       25
9       48       33       43       48       48

In [82]:
df[df.deger_1 > 20]["deger_1"]

1    46
3    49
4    39
5    46
7    29
9    48
Name: deger_1, dtype: int32

In [83]:
df[(df.deger_1 > 10) & (df.deger_3 < 15)]

   deger_1  deger_2  deger_3  deger_4  deger_5
4       39       48        5        9       45
7       29       12        6        1       25

In [84]:
df.loc[(df.deger_1 > 10) & (df.deger_3 < 15), ["deger_1", "deger_3"]]

   deger_1  deger_3
4       39        5
7       29        6

In [85]:
df[(df.deger_1 > 10) & (df.deger_3 < 15)][["deger_1", "deger_3"]]

   deger_1  deger_3
4       39        5
7       29        6

#### Birleştirme (Join) İşlemleri

In [86]:
import numpy as np
import pandas as pd
seri = np.random.randint(1,25, size = (5,3))
df = pd.DataFrame(seri , columns = ["deger_1", "deger_2", "deger_3"])
df

   deger_1  deger_2  deger_3
0       14        1        3
1       15       11       22
2        3       16       18
3       15       19       10
4       21       17       23

In [87]:
df_2 = df + 11
df_2

   deger_1  deger_2  deger_3
0       25       12       14
1       26       22       33
2       14       27       29
3       26       30       21
4       32       28       34

In [88]:
pd.concat([df,df_2])

   deger_1  deger_2  deger_3
0       14        1        3
1       15       11       22
2        3       16       18
3       15       19       10
4       21       17       23
0       25       12       14
1       26       22       33
2       14       27       29
3       26       30       21
4       32       28       34

ignore_index ile birleştirme sonrası bozuk olan sıralamayı düzeltebiliriz

In [89]:
pd.concat([df,df_2], ignore_index=True)

   deger_1  deger_2  deger_3
0       14        1        3
1       15       11       22
2        3       16       18
3       15       19       10
4       21       17       23
5       25       12       14
6       26       22       33
7       14       27       29
8       26       30       21
9       32       28       34

In [90]:
df_2.columns

Index(['deger_1', 'deger_2', 'deger_3'], dtype='object')

In [91]:
df_2.columns = ["deger_1", "degisken_2", "deger_3"]
df_2

   deger_1  degisken_2  deger_3
0       25          12       14
1       26          22       33
2       14          27       29
3       26          30       21
4       32          28       34

In [92]:
df

   deger_1  deger_2  deger_3
0       14        1        3
1       15       11       22
2        3       16       18
3       15       19       10
4       21       17       23

Değişken isimlendirmeleri farklı olduğundan birleştirme işlemi sonrası bazı değerlerin nan ifadesi aldığını gördük. Bu tür durumlarda join = "inner" i kullanarak keşisimlerinden oluşan sonuçları görebiliriz.

In [93]:
pd.concat([df,df_2])

   deger_1  deger_2  deger_3  degisken_2
0       14      1.0        3         NaN
1       15     11.0       22         NaN
2        3     16.0       18         NaN
3       15     19.0       10         NaN
4       21     17.0       23         NaN
0       25      NaN       14        12.0
1       26      NaN       33        22.0
2       14      NaN       29        27.0
3       26      NaN       21        30.0
4       32      NaN       34        28.0

In [94]:
pd.concat([df,df_2], join = "inner", ignore_index=True)

   deger_1  deger_3
0       14        3
1       15       22
2        3       18
3       15       10
4       21       23
5       25       14
6       26       33
7       14       29
8       26       21
9       32       34

#### İleri Birleştirme İşlemleri

In [95]:
import pandas as pd
df1 = pd.DataFrame ({"calisanlar": ["Ali","Veli","Ahmet", "Mehmet"],
                    "calisma_alani" : ["Muhasebe", "Muhendis","Muhendis","Cayci"]})
df1

  calisanlar calisma_alani
0        Ali      Muhasebe
1       Veli      Muhendis
2      Ahmet      Muhendis
3     Mehmet         Cayci

In [96]:
df2 = pd.DataFrame({"calisanlar": ["Ali","Veli","Ahmet", "Mehmet"],
                   "giris_yili": [2016,2020,2012,1998]})
df2

  calisanlar  giris_yili
0        Ali        2016
1       Veli        2020
2      Ahmet        2012
3     Mehmet        1998

In [97]:
pd.merge(df1,df2)

  calisanlar calisma_alani  giris_yili
0        Ali      Muhasebe        2016
1       Veli      Muhendis        2020
2      Ahmet      Muhendis        2012
3     Mehmet         Cayci        1998

In [98]:
pd.merge(df1,df2, on = "calisanlar")

  calisanlar calisma_alani  giris_yili
0        Ali      Muhasebe        2016
1       Veli      Muhendis        2020
2      Ahmet      Muhendis        2012
3     Mehmet         Cayci        1998

In [99]:
df3 = pd.merge(df1,df2)
df3

  calisanlar calisma_alani  giris_yili
0        Ali      Muhasebe        2016
1       Veli      Muhendis        2020
2      Ahmet      Muhendis        2012
3     Mehmet         Cayci        1998

In [100]:
df4 = pd.DataFrame({"calisma_alani": ["Muhasebe","Muhendis","Cayci"],
                   "mudur" : ["Yavuz", "Sadullah", "Yasin"]})
df4

  calisma_alani     mudur
0      Muhasebe     Yavuz
1      Muhendis  Sadullah
2         Cayci     Yasin

In [101]:
pd.merge(df3,df4)

  calisanlar calisma_alani  giris_yili     mudur
0        Ali      Muhasebe        2016     Yavuz
1       Veli      Muhendis        2020  Sadullah
2      Ahmet      Muhendis        2012  Sadullah
3     Mehmet         Cayci        1998     Yasin

In [102]:
df5 = pd.DataFrame({"calisma_alani": ["Muhasebe","Muhasebe","Muhendis","Muhendis","Muhendis","Cayci"],
                   "yetenekler": ["Excel","Matematik", "Python", "PHP","R","Çay demleme"]})
df5

  calisma_alani   yetenekler
0      Muhasebe        Excel
1      Muhasebe    Matematik
2      Muhendis       Python
3      Muhendis          PHP
4      Muhendis            R
5         Cayci  Çay demleme

In [103]:
pd.merge(df4,df5)

  calisma_alani     mudur   yetenekler
0      Muhasebe     Yavuz        Excel
1      Muhasebe     Yavuz    Matematik
2      Muhendis  Sadullah       Python
3      Muhendis  Sadullah          PHP
4      Muhendis  Sadullah            R
5         Cayci     Yasin  Çay demleme

In [104]:
pd.merge(df1,df5)

  calisanlar calisma_alani   yetenekler
0        Ali      Muhasebe        Excel
1        Ali      Muhasebe    Matematik
2       Veli      Muhendis       Python
3       Veli      Muhendis          PHP
4       Veli      Muhendis            R
5      Ahmet      Muhendis       Python
6      Ahmet      Muhendis          PHP
7      Ahmet      Muhendis            R
8     Mehmet         Cayci  Çay demleme

#### Toplulaştırma ve Gruplama

**Toplulaştırma Fonksiyonları**
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

Seaborn kütüphanesini tanımlama

In [105]:
import seaborn as sns

In [106]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [107]:
df.shape

(1035, 6)

In [108]:
df.ndim

2

In [109]:
df.size

6210

In [110]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [111]:
df["orbital_period"].mean()

2002.9175960947584

In [112]:
df["orbital_period"].count()

992

In [113]:
df["orbital_period"].min()

0.09070629

In [114]:
df["orbital_period"].max()

730000.0

In [115]:
df["orbital_period"].sum()

1986894.255326

In [116]:
df["orbital_period"].std()

26014.72830406252

In [117]:
df["orbital_period"].var()

676766088.7341915

In [118]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [119]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [120]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [121]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                  "veri":[10,15,53,42,12,55]}, columns=["gruplar", "veri"])
df

  gruplar  veri
0       A    10
1       B    15
2       C    53
3       A    42
4       B    12
5       C    55

In [122]:
df.groupby("gruplar")

In [123]:
df.groupby("gruplar").mean()

         veri
gruplar
A        26.0
B        13.5
C        54.0

In [124]:
df.groupby("gruplar").sum()

         veri
gruplar
A          52
B          27
C         108

In [125]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [126]:
df.groupby("method")

In [127]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [128]:
df.groupby("method")["orbital_period"].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [129]:
df.groupby("method")["orbital_period"].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,2.000000,9.000000,12.000000,7.000000,3.000000,5.000000,1.0,553.00000,397.000000,3.000000
mean,631.180000,4751.644444,118247.737500,3153.571429,0.709307,7343.021201,1170.0,823.35468,21.102073,79.783500
std,544.217663,2499.130945,213978.177277,1113.166333,0.725493,16313.265573,NaN,1454.92621,46.185893,71.599884
min,246.360000,1916.250000,4639.150000,1825.000000,0.240104,0.090706,1170.0,0.73654,0.355000,22.339500
25%,438.770000,2900.000000,8343.900000,2375.000000,0.291496,25.262000,1170.0,38.02100,3.160630,39.675250
50%,631.180000,4343.500000,27500.000000,3300.000000,0.342887,66.541900,1170.0,360.20000,5.714932,57.011000
75%,823.590000,5767.000000,94250.000000,3550.000000,0.943908,98.211400,1170.0,982.00000,16.145700,108.505500
max,1016.000000,10220.000000,730000.000000,5100.000000,1.544929,36525.000000,1170.0,17337.50000,331.600590,160.000000

#### İleri Toplulaştırma İşlemleri (Aggregate,Filter,Transform,Apply)

In [130]:
import pandas as pd
df = pd.DataFrame({"gruplar": ["A", "B", "C", "A", "B", "C"],
                  "degisken1": [10,25,99,53,35,43],
                  "degisken2": [24,48,64,192,255,888]}, columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10         24
1       B         25         48
2       C         99         64
3       A         53        192
4       B         35        255
5       C         43        888

In [131]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             31.5      108.0
B             30.0      151.5
C             71.0      476.0

In [132]:
df.groupby("gruplar").aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   31.5  53        24  108.0  192
B              25   30.0  35        48  151.5  255
C              43   71.0  99        64  476.0  888

In [133]:
df.groupby("gruplar").aggregate({"degisken1": [min,max], "degisken2": np.median})

        degisken1     degisken2
              min max    median
gruplar
A              10  53     108.0
B              25  35     151.5
C              43  99     476.0

standart sapması 9 dan büyük alan grupları göstermek istiyoruz bunun için filtreleme işlemi yapmamız lazım

In [134]:
def filter_func(filtrele):
    return filtrele["degisken1"].std() > 9

df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
0       A         10         24
2       C         99         64
3       A         53        192
5       C         43        888

bir de normal grupların standart sapmalarına bakalım

In [135]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A        30.405592  118.793939
B         7.071068  146.371104
C        39.597980  582.655988

In [136]:
df_1 = df.iloc[:,1:3]

In [137]:
df_1.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -1.113821  -0.675011
1  -0.624827  -0.601762
2   1.787547  -0.552929
3   0.287964  -0.162267
4  -0.298830   0.030012
5  -0.038033   1.961958

In [138]:
import pandas as pd
df = pd.DataFrame({"degisken1": [10,25,99,53,35,43],
                  "degisken2": [24,48,64,192,255,888]}, 
                  columns = ["degisken1","degisken2"])
df

   degisken1  degisken2
0         10         24
1         25         48
2         99         64
3         53        192
4         35        255
5         43        888

In [139]:
df.apply(np.sum)

degisken1     265
degisken2    1471
dtype: int64

#### Pivot Tablolar

In [140]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [141]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [142]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [143]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [144]:
titanic.age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [145]:
age = pd.cut(titanic["age"], [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [146]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

#### Dış Kaynaklardan Veri Okumak

In [147]:
import pandas as pd
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [148]:
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [149]:
df = pd.read_excel("reading_data/ornekx.xlsx")

In [150]:
type(df)

pandas.core.frame.DataFrame

In [151]:
df.columns = ("A", "B", "C")
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [152]:
tips = pd.read_csv("reading_data/tips.txt")
tips.head(10)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2